In [1]:
import pandas as pd

In [2]:
# add csv files

In [3]:
csv_file0 = "data/AdventureWorks_Customers.csv"
Customers_df = pd.read_csv(csv_file0, encoding="ISO-8859_1")

In [4]:
Customers_df['BirthDate'] = pd.to_datetime(Customers_df['BirthDate'])

In [5]:
Customers_df["BirthDate"] = pd.to_datetime(Customers_df["BirthDate"]).dt.strftime('%Y-%m-%d')

In [6]:
Customers_df['AnnualIncome']=Customers_df['AnnualIncome'].str.replace('$' ,'')

C:\Users\gcwhi\AppData\Local\Temp/ipykernel_8320/1830080430.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  Customers_df['AnnualIncome']=Customers_df['AnnualIncome'].str.replace('$' ,'')

In [7]:
Customers_df['AnnualIncome']=Customers_df['AnnualIncome'].str.replace(',' ,'')

In [8]:
Customers_df['AnnualIncome'] = pd.to_numeric(Customers_df['AnnualIncome'])

In [9]:
Customers_df.describe()

        CustomerKey   AnnualIncome  TotalChildren
count  18148.000000   18148.000000   18148.000000
mean   20247.470465   57269.120564       1.843619
std     5336.245656   32236.535573       1.613203
min    11000.000000   10000.000000       0.000000
25%    15626.750000   30000.000000       0.000000
50%    20252.500000   60000.000000       2.000000
75%    24868.250000   70000.000000       3.000000
max    29483.000000  170000.000000       5.000000

In [10]:
Customers_df

,CustomerKey,Prefix,FirstName,LastName,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner
0,11000,MR.,JON,YANG,1966-04-08,M,M,jon24@adventure-works.com,90000,2,Bachelors,Professional,Y
1,11001,MR.,EUGENE,HUANG,1965-05-14,S,M,eugene10@adventure-works.com,60000,3,Bachelors,Professional,N
2,11002,MR.,RUBEN,TORRES,1965-08-12,M,M,ruben35@adventure-works.com,60000,3,Bachelors,Professional,Y
3,11003,MS.,CHRISTY,ZHU,1968-02-15,S,F,christy12@adventure-works.com,70000,0,Bachelors,Professional,N
4,11004,MRS.,ELIZABETH,JOHNSON,1968-08-08,S,F,elizabeth5@adventure-works.com,80000,5,Bachelors,Professional,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
18143,29479,MR.,TOMMY,TANG,1958-07-04,M,M,tommy2@adventure-works.com,30000,1,Graduate Degree,Clerical,Y
18144,29480,MRS.,NINA,RAJI,1960-11-10,S,F,nina21@adventure-works.com,30000,3,Graduate Degree,Clerical,Y
18145,29481,MR.,IVAN,SURI,1960-01-05,S,M,ivan0@adventure-works.com,30000,3,Graduate Degree,Clerical,N
18146,29482,MR.,CLAYTON,ZHANG,1959-03-05,M,M,clayton0@adventure-works.com,30000,3,Bachelors,Clerical,Y
18147,29483,MR.,JÉSUS,NAVARRO,1959-12-08,M,M,jésus9@adventure-works.com,30000,0,Bachelors,Clerical,Y

In [11]:
csv_file1 = "data/AdventureWorks_Calendar.csv"
Calendar_df = pd.read_csv(csv_file1)

In [12]:
Calendar_df["Date"] = pd.to_datetime(Calendar_df["Date"]).dt.strftime('%Y-%m-%d')

In [13]:
Calendar_df = Calendar_df.reset_index(drop=False)

In [14]:
Calendar_df

     index        Date
0        0  2015-01-01
1        1  2015-01-02
2        2  2015-01-03
3        3  2015-01-04
4        4  2015-01-05
..     ...         ...
907    907  2017-06-26
908    908  2017-06-27
909    909  2017-06-28
910    910  2017-06-29
911    911  2017-06-30

[912 rows x 2 columns]

In [15]:
Calendar_df.rename(columns={'index': 'dateId'},inplace=True)

In [16]:
Calendar_df

     dateId        Date
0         0  2015-01-01
1         1  2015-01-02
2         2  2015-01-03
3         3  2015-01-04
4         4  2015-01-05
..      ...         ...
907     907  2017-06-26
908     908  2017-06-27
909     909  2017-06-28
910     910  2017-06-29
911     911  2017-06-30

[912 rows x 2 columns]

In [17]:
csv_file2 = "data/AdventureWorks_Product_Categories.csv"
Product_Categories_df = pd.read_csv(csv_file2)

In [18]:
csv_file3 = "data/AdventureWorks_Product_Subcategories.csv"
Product_Subcategories_df = pd.read_csv(csv_file3)

In [19]:
categories = pd.merge(Product_Subcategories_df,Product_Categories_df, how="left",on='ProductCategoryKey')

In [20]:
categories

    ProductSubcategoryKey    SubcategoryName  ProductCategoryKey CategoryName
0                       1     Mountain Bikes                   1        Bikes
1                       2         Road Bikes                   1        Bikes
2                       3      Touring Bikes                   1        Bikes
3                       4         Handlebars                   2   Components
4                       5    Bottom Brackets                   2   Components
5                       6             Brakes                   2   Components
6                       7             Chains                   2   Components
7                       8          Cranksets                   2   Components
8                       9        Derailleurs                   2   Components
9                      10              Forks                   2   Components
10                     11           Headsets                   2   Components
11                     12    Mountain Frames                   2   Components
12                     13             Pedals                   2   Components
13                     14        Road Frames                   2   Components
14                     15            Saddles                   2   Components
15                     16     Touring Frames                   2   Components
16                     17             Wheels                   2   Components
17                     18         Bib-Shorts                   3     Clothing
18                     19               Caps                   3     Clothing
19                     20             Gloves                   3     Clothing
20                     21            Jerseys                   3     Clothing
21                     22             Shorts                   3     Clothing
22                     23              Socks                   3     Clothing
23                     24             Tights                   3     Clothing
24                     25              Vests                   3     Clothing
25                     26         Bike Racks                   4  Accessories
26                     27        Bike Stands                   4  Accessories
27                     28  Bottles and Cages                   4  Accessories
28                     29           Cleaners                   4  Accessories
29                     30            Fenders                   4  Accessories
30                     31            Helmets                   4  Accessories
31                     32    Hydration Packs                   4  Accessories
32                     33             Lights                   4  Accessories
33                     34              Locks                   4  Accessories
34                     35           Panniers                   4  Accessories
35                     36              Pumps                   4  Accessories
36                     37    Tires and Tubes                   4  Accessories

In [21]:
csv_file3 = "data/AdventureWorks_Products.csv"
Products_df = pd.read_csv(csv_file3)

In [22]:
Products_df

,ProductKey,ProductSubcategoryKey,ProductSKU,ProductName,ModelName,ProductDescription,ProductColor,ProductSize,ProductStyle,ProductCost,ProductPrice
0,214,31,HL-U509-R,"Sport-100 Helmet, Red",Sport-100,"Universal fit, well-vented, lightweight , snap...",Red,0,0,13.0863,34.9900
1,215,31,HL-U509,"Sport-100 Helmet, Black",Sport-100,"Universal fit, well-vented, lightweight , snap...",Black,0,0,12.0278,33.6442
2,218,23,SO-B909-M,"Mountain Bike Socks, M",Mountain Bike Socks,Combination of natural and synthetic fibers st...,White,M,U,3.3963,9.5000
3,219,23,SO-B909-L,"Mountain Bike Socks, L",Mountain Bike Socks,Combination of natural and synthetic fibers st...,White,L,U,3.3963,9.5000
4,220,31,HL-U509-B,"Sport-100 Helmet, Blue",Sport-100,"Universal fit, well-vented, lightweight , snap...",Blue,0,0,12.0278,33.6442
...,...,...,...,...,...,...,...,...,...,...,...
288,602,5,BB-8107,ML Bottom Bracket,ML Bottom Bracket,Aluminum alloy cups; large diameter spindle.,NaN,0,0,44.9506,101.2400
289,603,5,BB-9108,HL Bottom Bracket,HL Bottom Bracket,Aluminum alloy cups and a hollow axle.,NaN,0,0,53.9416,121.4900
290,604,2,BK-R19B-44,"Road-750 Black, 44",Road-750,Entry level adult bike; offers a comfortable r...,Black,44,U,343.6496,539.9900
291,605,2,BK-R19B-48,"Road-750 Black, 48",Road-750,Entry level adult bike; offers a comfortable r...,Black,48,U,343.6496,539.9900
292,606,2,BK-R19B-52,"Road-750 Black, 52",Road-750,Entry level adult bike; offers a comfortable r...,Black,52,U,343.6496,539.9900

In [23]:
csv_file4 = "data/AdventureWorks_Returns.csv"
Returns_df = pd.read_csv(csv_file4)

In [24]:
Returns_df["ReturnDate"] = pd.to_datetime(Returns_df["ReturnDate"]).dt.strftime('%Y-%m-%d')

In [25]:
Returns_df

      ReturnDate  TerritoryKey  ProductKey  ReturnQuantity
0     2015-01-18             9         312               1
1     2015-01-18            10         310               1
2     2015-01-21             8         346               1
3     2015-01-22             4         311               1
4     2015-02-02             6         312               1
...          ...           ...         ...             ...
1804  2017-06-30             6         491               1
1805  2017-06-30             8         477               1
1806  2017-06-30             9         477               1
1807  2017-06-30            10         223               1
1808  2017-06-30            10         477               1

[1809 rows x 4 columns]

In [26]:
Returns_df = Returns_df.reset_index(drop=False)

In [27]:
Returns_df

      index  ReturnDate  TerritoryKey  ProductKey  ReturnQuantity
0         0  2015-01-18             9         312               1
1         1  2015-01-18            10         310               1
2         2  2015-01-21             8         346               1
3         3  2015-01-22             4         311               1
4         4  2015-02-02             6         312               1
...     ...         ...           ...         ...             ...
1804   1804  2017-06-30             6         491               1
1805   1805  2017-06-30             8         477               1
1806   1806  2017-06-30             9         477               1
1807   1807  2017-06-30            10         223               1
1808   1808  2017-06-30            10         477               1

[1809 rows x 5 columns]

In [28]:
Returns_df.rename(columns={'index': 'returnId'},inplace=True)

In [29]:
Returns_df

      returnId  ReturnDate  TerritoryKey  ProductKey  ReturnQuantity
0            0  2015-01-18             9         312               1
1            1  2015-01-18            10         310               1
2            2  2015-01-21             8         346               1
3            3  2015-01-22             4         311               1
4            4  2015-02-02             6         312               1
...        ...         ...           ...         ...             ...
1804      1804  2017-06-30             6         491               1
1805      1805  2017-06-30             8         477               1
1806      1806  2017-06-30             9         477               1
1807      1807  2017-06-30            10         223               1
1808      1808  2017-06-30            10         477               1

[1809 rows x 5 columns]

In [30]:
csv_file5 = "data/AdventureWorks_Sales_2015.csv"
Sales_2015_df = pd.read_csv(csv_file5)

In [31]:
csv_file6 = "data/AdventureWorks_Sales_2016.csv"
Sales_2016_df = pd.read_csv(csv_file6)

In [32]:
csv_file7 = "data/AdventureWorks_Sales_2017.csv"
Sales_2017_df = pd.read_csv(csv_file7)

In [33]:
sales = [Sales_2015_df, Sales_2016_df, Sales_2017_df]

In [34]:
all_sales = pd.concat(sales)

In [35]:
all_sales["OrderDate"] = pd.to_datetime(all_sales["OrderDate"]).dt.strftime('%Y-%m-%d')

In [36]:
all_sales["StockDate"] = pd.to_datetime(all_sales["StockDate"]).dt.strftime('%Y-%m-%d')

In [37]:
all_sales.rename(columns={'TerritoryKey': 'SalesTerritoryKey'},inplace=True)

In [38]:
all_sales

,OrderDate,StockDate,OrderNumber,ProductKey,CustomerKey,SalesTerritoryKey,OrderLineItem,OrderQuantity
0,2015-01-01,2001-09-21,SO45080,332,14657,1,1,1
1,2015-01-01,2001-12-05,SO45079,312,29255,4,1,1
2,2015-01-01,2001-10-29,SO45082,350,11455,9,1,1
3,2015-01-01,2001-11-16,SO45081,338,26782,6,1,1
4,2015-01-02,2001-12-15,SO45083,312,14947,10,1,1
...,...,...,...,...,...,...,...,...
29476,2017-06-30,2004-03-22,SO74143,477,28517,10,3,2
29477,2017-06-30,2004-03-15,SO74143,479,28517,10,2,1
29478,2017-06-30,2004-04-08,SO74143,606,28517,10,1,1
29479,2017-06-30,2004-05-15,SO74124,480,21676,7,2,2
29480,2017-06-30,2004-05-04,SO74124,538,21676,7,1,2

In [39]:
all_sales = all_sales.reset_index(drop=False)

In [40]:
all_sales

,index,OrderDate,StockDate,OrderNumber,ProductKey,CustomerKey,SalesTerritoryKey,OrderLineItem,OrderQuantity
0,0,2015-01-01,2001-09-21,SO45080,332,14657,1,1,1
1,1,2015-01-01,2001-12-05,SO45079,312,29255,4,1,1
2,2,2015-01-01,2001-10-29,SO45082,350,11455,9,1,1
3,3,2015-01-01,2001-11-16,SO45081,338,26782,6,1,1
4,4,2015-01-02,2001-12-15,SO45083,312,14947,10,1,1
...,...,...,...,...,...,...,...,...,...
56041,29476,2017-06-30,2004-03-22,SO74143,477,28517,10,3,2
56042,29477,2017-06-30,2004-03-15,SO74143,479,28517,10,2,1
56043,29478,2017-06-30,2004-04-08,SO74143,606,28517,10,1,1
56044,29479,2017-06-30,2004-05-15,SO74124,480,21676,7,2,2
56045,29480,2017-06-30,2004-05-04,SO74124,538,21676,7,1,2

In [41]:
all_sales = all_sales.reset_index(level=0)

In [42]:
all_sales

,level_0,index,OrderDate,StockDate,OrderNumber,ProductKey,CustomerKey,SalesTerritoryKey,OrderLineItem,OrderQuantity
0,0,0,2015-01-01,2001-09-21,SO45080,332,14657,1,1,1
1,1,1,2015-01-01,2001-12-05,SO45079,312,29255,4,1,1
2,2,2,2015-01-01,2001-10-29,SO45082,350,11455,9,1,1
3,3,3,2015-01-01,2001-11-16,SO45081,338,26782,6,1,1
4,4,4,2015-01-02,2001-12-15,SO45083,312,14947,10,1,1
...,...,...,...,...,...,...,...,...,...,...
56041,56041,29476,2017-06-30,2004-03-22,SO74143,477,28517,10,3,2
56042,56042,29477,2017-06-30,2004-03-15,SO74143,479,28517,10,2,1
56043,56043,29478,2017-06-30,2004-04-08,SO74143,606,28517,10,1,1
56044,56044,29479,2017-06-30,2004-05-15,SO74124,480,21676,7,2,2
56045,56045,29480,2017-06-30,2004-05-04,SO74124,538,21676,7,1,2

In [43]:
all_sales.pop('index')

0            0
1            1
2            2
3            3
4            4
         ...
56041    29476
56042    29477
56043    29478
56044    29479
56045    29480
Name: index, Length: 56046, dtype: int64

In [44]:
all_sales

,level_0,OrderDate,StockDate,OrderNumber,ProductKey,CustomerKey,SalesTerritoryKey,OrderLineItem,OrderQuantity
0,0,2015-01-01,2001-09-21,SO45080,332,14657,1,1,1
1,1,2015-01-01,2001-12-05,SO45079,312,29255,4,1,1
2,2,2015-01-01,2001-10-29,SO45082,350,11455,9,1,1
3,3,2015-01-01,2001-11-16,SO45081,338,26782,6,1,1
4,4,2015-01-02,2001-12-15,SO45083,312,14947,10,1,1
...,...,...,...,...,...,...,...,...,...
56041,56041,2017-06-30,2004-03-22,SO74143,477,28517,10,3,2
56042,56042,2017-06-30,2004-03-15,SO74143,479,28517,10,2,1
56043,56043,2017-06-30,2004-04-08,SO74143,606,28517,10,1,1
56044,56044,2017-06-30,2004-05-15,SO74124,480,21676,7,2,2
56045,56045,2017-06-30,2004-05-04,SO74124,538,21676,7,1,2

In [45]:
all_sales.rename(columns={'level_0': 'saleId'},inplace=True)

In [46]:
all_sales

,saleId,OrderDate,StockDate,OrderNumber,ProductKey,CustomerKey,SalesTerritoryKey,OrderLineItem,OrderQuantity
0,0,2015-01-01,2001-09-21,SO45080,332,14657,1,1,1
1,1,2015-01-01,2001-12-05,SO45079,312,29255,4,1,1
2,2,2015-01-01,2001-10-29,SO45082,350,11455,9,1,1
3,3,2015-01-01,2001-11-16,SO45081,338,26782,6,1,1
4,4,2015-01-02,2001-12-15,SO45083,312,14947,10,1,1
...,...,...,...,...,...,...,...,...,...
56041,56041,2017-06-30,2004-03-22,SO74143,477,28517,10,3,2
56042,56042,2017-06-30,2004-03-15,SO74143,479,28517,10,2,1
56043,56043,2017-06-30,2004-04-08,SO74143,606,28517,10,1,1
56044,56044,2017-06-30,2004-05-15,SO74124,480,21676,7,2,2
56045,56045,2017-06-30,2004-05-04,SO74124,538,21676,7,1,2

In [47]:
all_sales.to_csv('Resources/combined_sales.csv',index = False)

In [48]:
csv_file8 = "data/AdventureWorks_Territories.csv"
Territories_df = pd.read_csv(csv_file8)

In [49]:
Customers_df.to_csv('Resources/customers.csv',index = False)

In [50]:
Calendar_df.to_csv('Resources/calendar.csv',index = False)

In [51]:
Returns_df.to_csv('Resources/returns.csv',index = False)

In [52]:
Products_df.to_csv('Resources/products.csv',index = False)

In [53]:
Territories_df.to_csv('Resources/territories.csv',index = False)

In [54]:
categories.to_csv('Resources/categories.csv',index = False)

In [55]:
categories.head()

   ProductSubcategoryKey  SubcategoryName  ProductCategoryKey CategoryName
0                      1   Mountain Bikes                   1        Bikes
1                      2       Road Bikes                   1        Bikes
2                      3    Touring Bikes                   1        Bikes
3                      4       Handlebars                   2   Components
4                      5  Bottom Brackets                   2   Components

In [56]:
Returns_df.head()

   returnId  ReturnDate  TerritoryKey  ProductKey  ReturnQuantity
0         0  2015-01-18             9         312               1
1         1  2015-01-18            10         310               1
2         2  2015-01-21             8         346               1
3         3  2015-01-22             4         311               1
4         4  2015-02-02             6         312               1

In [57]:
Territories_df.head()

   SalesTerritoryKey     Region        Country      Continent
0                  1  Northwest  United States  North America
1                  2  Northeast  United States  North America
2                  3    Central  United States  North America
3                  4  Southwest  United States  North America
4                  5  Southeast  United States  North America

In [58]:
Products_df.head()

,ProductKey,ProductSubcategoryKey,ProductSKU,ProductName,ModelName,ProductDescription,ProductColor,ProductSize,ProductStyle,ProductCost,ProductPrice
0,214,31,HL-U509-R,"Sport-100 Helmet, Red",Sport-100,"Universal fit, well-vented, lightweight , snap...",Red,0,0,13.0863,34.9900
1,215,31,HL-U509,"Sport-100 Helmet, Black",Sport-100,"Universal fit, well-vented, lightweight , snap...",Black,0,0,12.0278,33.6442
2,218,23,SO-B909-M,"Mountain Bike Socks, M",Mountain Bike Socks,Combination of natural and synthetic fibers st...,White,M,U,3.3963,9.5000
3,219,23,SO-B909-L,"Mountain Bike Socks, L",Mountain Bike Socks,Combination of natural and synthetic fibers st...,White,L,U,3.3963,9.5000
4,220,31,HL-U509-B,"Sport-100 Helmet, Blue",Sport-100,"Universal fit, well-vented, lightweight , snap...",Blue,0,0,12.0278,33.6442

In [59]:
Customers_df.head()

,CustomerKey,Prefix,FirstName,LastName,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner
0,11000,MR.,JON,YANG,1966-04-08,M,M,jon24@adventure-works.com,90000,2,Bachelors,Professional,Y
1,11001,MR.,EUGENE,HUANG,1965-05-14,S,M,eugene10@adventure-works.com,60000,3,Bachelors,Professional,N
2,11002,MR.,RUBEN,TORRES,1965-08-12,M,M,ruben35@adventure-works.com,60000,3,Bachelors,Professional,Y
3,11003,MS.,CHRISTY,ZHU,1968-02-15,S,F,christy12@adventure-works.com,70000,0,Bachelors,Professional,N
4,11004,MRS.,ELIZABETH,JOHNSON,1968-08-08,S,F,elizabeth5@adventure-works.com,80000,5,Bachelors,Professional,Y

In [60]:
all_sales.head()

,saleId,OrderDate,StockDate,OrderNumber,ProductKey,CustomerKey,SalesTerritoryKey,OrderLineItem,OrderQuantity
0,0,2015-01-01,2001-09-21,SO45080,332,14657,1,1,1
1,1,2015-01-01,2001-12-05,SO45079,312,29255,4,1,1
2,2,2015-01-01,2001-10-29,SO45082,350,11455,9,1,1
3,3,2015-01-01,2001-11-16,SO45081,338,26782,6,1,1
4,4,2015-01-02,2001-12-15,SO45083,312,14947,10,1,1

In [61]:
Calendar_df.head()

   dateId        Date
0       0  2015-01-01
1       1  2015-01-02
2       2  2015-01-03
3       3  2015-01-04
4       4  2015-01-05

In [62]:
from sqlalchemy import create_engine
from config import postgresPass as pw

In [63]:
protocol = 'postgresql'
username = 'postgres'
password = pw
host = 'localhost'
port = 5432
database_name = 'bike_shop_pr3'
rds_connection_string = f'{protocol}://{username}:{password}@{host}:{port}/{database_name}'
engine = create_engine(rds_connection_string)

In [65]:
engine.table_names()

C:\Users\gcwhi\AppData\Local\Temp/ipykernel_8320/4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['customers',
 'combined_sales',
 'calendar',
 'products',
 'categories',
 'returns',
 'territories']

In [66]:
categories.to_sql(name='categories', con=engine, if_exists='append', index=False)

In [67]:
Products_df.to_sql(name='products', con=engine, if_exists='append', index=False)

In [68]:
Territories_df.to_sql(name='territories', con=engine, if_exists='append', index=False)

In [69]:
Calendar_df.to_sql(name='calendar', con=engine, if_exists='append', index=False)

In [70]:
Customers_df.to_sql(name='customers', con=engine, if_exists='append', index=False)

In [71]:
Returns_df.to_sql(name='returns', con=engine, if_exists='append', index=False)

In [72]:
all_sales.to_sql(name='combined_sales', con=engine, if_exists='append', index=False)